<template>
  <div class="about">
    <h2>关于时间胶囊</h2>
    <div class="what">
      <h3>1. 什么是时间胶囊</h3>
      <p>时间胶囊是将现在的生活和心情记录下来，寄给遥远的未来。
      它可以是一个预言，一篇日记，一句牢骚，一种证明，也可能只是一句“我爱你”，请发挥你的想象力使用它吧。</p>
      <h3>2. 为什么要使用区块链</h3>
      <p>由于对未来的不可知，任何人都无法确保服务一直存在，尤其你的时间跨度可能是几年甚至几十年。
      区块链技术让跨越时间成为可能，只要还有人使用（可自己建立节点）就永久不会消亡。
      区块链技术的放篡改和区块的时间戳让网络世界的时间胶囊变得更完美。
      </p>
      <h3>3. 怎么埋下时间胶囊</h3>
      <p>
      项目使用以太坊智能合约开发，请使用PC版浏览器安装Metamask后操作。
      具体教程可参考
      <a href="https://github.com/NanQi/time-capsule/wiki/%E5%A6%82%E4%BD%95%E4%BD%BF%E7%94%A8%E6%97%B6%E9%97%B4%E8%83%B6%E5%9B%8A">此文章</a>。
      埋下胶囊根据存储内容长度，需要支付相应的以太坊，需要用户自行承担，
      鉴于以太坊目前价格过高，项目暂时只支持Rinkeby测试网络，后续会逐步完善。
      </p>
      <h3>4. 你们的域名到期了怎么办</h3>
      <p>
      虽是去中心化应用（dapp），但是运行的域名和服务器依然是中心化的不假，
      所以我们在IPFS上也部署了一个dapp，任何人都可以部署此项目。
      项目完全
      <a href="https://github.com/NanQi/time-capsule">开源</a>，并且提供技术交流服务。
      </p>
      <h3>5. 为什么要做这个项目</h3>
      <p>
      验证项目使用智能合约开发的可行性，其中会涉及私密内容上链，
      智能合约随机数，代币经济等问题。
      对于这个项目而言，有人可能会说对用户没有价值，
      但是时间胶囊本身已经很贴切区块链应用层面，这个项目会一直存在。
      </p>
      <h3>6. 你说的代币是什么</h3>
      <p>
      我们会尝试在此项目中使用代币经济，会发行ERC20规范的TCC（time capsule coin），
      用户埋下胶囊，我们前期会奖励3个TCC，挖时间胶囊需要消耗1个TCC，
      我们还记得在微信普及时代每天打捞漂流瓶的大学生们，相信这个代币不会那么牵强。
      </p>
      <h3>7. 我们是谁</h3>
      <p>
      我们是西安慢连互联网有限公司，我们致力永久保存人类精神产品，
      为此我们推出了多种产品，想连接跨越时间维度的我和你，
      这个项目只是我们对区块链应用层面的一个探索，正在开发EOS版本，敬请期待。
      </p>
    </div>
  </div>
</template>

<style>
.what {
  width: 450px;
  text-align: left;
  margin: 0 auto;
}
</style>
